{
  "caption": "They Took My Brother Because He Filmed the Police",
  "desc": "My brother, Aman, isn't an activist. He's just a student who happened to be in the wrong place with a phone. He filmed a group of officers hitting a street vendor in our neighborhood. That video went viral for a few hours. The next morning, two men in plainclothes came asking for him. We haven’t seen him since. That was two weeks ago. No FIR. No explanation. Just silence. I’m terrified. I don’t even know if posting this will make things worse. But someone has to know. If anyone out there has faced the same, please speak up. We can’t keep letting them make people disappear.",
  "imgs": [],
  "time": "2025-07-01T18:35:00Z",
  "location": "Lucknow, India",
  "walletAddress": "0x6A1...eB1",
  "votes": 0
}

{
  "caption": "We Were Forced to Work Without Masks During the Leak",
  "desc": "I worked at the plant in Sector 18 for over 6 years. When the leak happened last month, we were told to 'keep quiet' and 'get back to work.' The gas made my eyes burn and my chest tighten. But they didn’t stop operations. They didn't even give us masks. Five of my coworkers fell sick within days. One collapsed on the floor. We weren’t allowed to talk to the media. I’m posting this anonymously because I’m scared of losing my job — or worse. But people need to know what they’re doing to us in there.",
  "imgs": [],
  "time": "2025-07-03T11:00:00Z",
  "location": "Vadodara, India",
  "walletAddress": "0x4B2...9F3",
  "votes": 0
}
✅ Article 3
json
Copy
Edit
{
  "caption": "My Article Was Removed — Twice. Here It Is Again.",
  "desc": "I wrote a piece exposing irregularities in a government housing scheme. Within hours of publishing it on two different platforms, both took it down citing ‘violations’. No explanation. No response. I didn’t name individuals. I cited public reports. Still, it vanished. So I’m posting it here. I don’t need likes or followers. I just want the truth out there. If you’re reading this, please make a copy. Censorship wins only when we stay silent.",
  "imgs": [],
  "time": "2025-07-04T14:20:00Z",
  "location": "Jaipur, India",
  "walletAddress": "0x812...2C4",
  "votes": 0
}
✅ Article 4
json
Copy
Edit
{
  "caption": "I Was Beaten for Asking About My Land",
  "desc": "My name isn’t important. I live in a small village where our land was taken for a ‘project’ we never approved. I went to the district office to ask for papers. They told me to leave. The next day, two men came to my home and threatened my son. I still tried to go back and ask again. They beat me in front of the office. My neighbor filmed it. I don’t want money. I want justice. Or at least, I want people to know we’re not just statistics on some spreadsheet.",
  "imgs": [],
  "time": "2025-07-05T10:10:00Z",
  "location": "Chhattisgarh, India",
  "walletAddress": "0x9F5...7A0",
  "votes": 0
}
✅ Article 5
json
Copy
Edit
{
  "caption": "They Fired Me After I Reported the Safety Violations",
  "desc": "I was a junior engineer at a private construction site. I reported a faulty scaffold to my supervisor — it collapsed the next week. A worker died. HR told me to 'keep quiet' and blamed the worker for 'carelessness'. I sent an internal complaint. A week later, I was let go for 'performance issues'. I kept every email, every image, every report. If anything happens to me, this is my record. The company knows what they did. And so will you now.",
  "imgs": [],
  "time": "2025-07-06T09:15:00Z",
  "location": "Hyderabad, India",
  "walletAddress": "0x3A7...F93",
  "votes": 0
}
✅ Article 6
json
Copy
Edit
{
  "caption": "A Call That Changed Everything",
  "desc": "I was covering a protest for my small blog when I got a call from someone claiming to be from the Intelligence Bureau. They asked why I was spreading 'anti-national content'. I hung up. Hours later, my website was offline. I received an email from my hosting provider saying the site was under review. This is the reality of being a small, independent voice in a loud, state-run media environment. They don’t need to arrest you — they just erase you quietly.",
  "imgs": [],
  "time": "2025-07-06T17:45:00Z",
  "location": "Delhi, India",
  "walletAddress": "0x2C1...6AE",
  "votes": 0
}
✅ Article 7
json
Copy
Edit
{
  "caption": "They Bribed Us to Stay Quiet About the Chemical Spill",
  "desc": "I worked near the Bhilai plant where the spill happened in June. They said it was 'minor'. It wasn’t. Fish started floating in the river. Children fell sick. Then they sent people door to door with ‘relief packages’ — food, money, and a waiver form. We were told to sign and not talk. My neighbor’s child still can’t breathe properly. I didn’t take their money. I don’t want it. I want someone to be held responsible. Even if I have to write this from a café 30km away just to get WiFi without being watched.",
  "imgs": [],
  "time": "2025-07-08T15:30:00Z",
  "location": "Durg, India",
  "walletAddress": "0x7D2...1B8",
  "votes": 0
}
✅ Article 8
json
Copy
Edit
{
  "caption": "My Internet Was Cut for a Tweet",
  "desc": "I tweeted a video of a local rally that turned violent — but only after the police started pushing. That’s all I said. Within an hour, my tweet was flagged. By evening, my internet was down. Not just mine — a few others in my lane too. When I asked the provider, they said they were 'updating systems'. Funny timing. This is how digital control works now. They don’t knock on your door. They just switch you off.",
  "imgs": [],
  "time": "2025-07-09T12:00:00Z",
  "location": "Pune, India",
  "walletAddress": "0xD91...3B1",
  "votes": 0
}
✅ Article 9
json
Copy
Edit
{
  "caption": "I Still Don’t Know Why I Was Detained",
  "desc": "I was standing outside the metro station holding a poster about free speech. I didn’t shout. I didn’t block traffic. Three cops came, took my ID, and told me I had to ‘come for questioning’. I was held for 9 hours, asked about my social media, my friends, even my college. No charges. Just questions. They let me go before midnight. My phone had been opened. My photos were gone. My only mistake was thinking I could speak freely. I’m not so sure anymore.",
  "imgs": [],
  "time": "2025-07-10T20:10:00Z",
  "location": "Kolkata, India",
  "walletAddress": "0x1F0...E52",
  "votes": 0
}