const mockPosts = [
  
  {
    title: "The Factory That Makes Kids Sick",
    content: `There’s a textile dyeing factory near our village. The water in our wells has turned pale green. The goats have stopped drinking from it. And the kids have started falling sick — constant stomach problems, skin rashes, and a strange bitter taste in the food cooked with the same water.

At first, we thought it was seasonal. Then one local doctor quietly told me the truth: the chemicals being dumped by the factory were likely responsible. I collected samples and sent them to a lab. The results showed dangerous levels of chromium and lead.

I confronted the plant manager. He smiled and said, “We have all the licenses. Go complain to whoever you want.” So I did — and no one responded. The Gram Panchayat said it was a state issue. The state helpline said it was under central regulation. It was a perfect loop of apathy.

I’m attaching lab reports, photos of the water, and a copy of the complaint letter — all for documentation. Maybe someone will finally listen.`,
    walletAddress: "0xFfA123Cc3344BbAaEe123999cDdBb11223344566",
    timestamp: new Date().toISOString(),
    location: "Erode, Tamil Nadu",
    imgs: ["image_0.jpg", "image_1.jpg"],
    votes: 0,
  },
  {
    title: "Public School, Private Profits",
    content: `I’m a teacher in a government school. Every year, the school receives funding for new desks, smartboards, tablets, and sometimes even for repainting the walls. But those things either don’t arrive — or arrive in such poor condition they’re unusable.

This year, the school claimed on paper that 40 tablets were distributed. I checked the records. Only 12 arrived. When I brought it up, the head clerk told me to mind my own business.

I began taking pictures and quietly recording meetings. I discovered a group of contractors who work with multiple schools, inflating costs and splitting kickbacks with local education officers. It’s heartbreaking. We still teach students under broken fans, asking them to bring chalk because the school can’t afford it.

What’s worse is that anyone who speaks out is either transferred or threatened. I’m sharing this story under a pseudonym — not because I’m afraid, but because the children deserve better. Their education shouldn’t be a source of someone else's wealth.`,
    walletAddress: "anonymous",
    timestamp: new Date().toISOString(),
    location: "Madhubani, Bihar",
    imgs: [],
    votes: 0,
  },
  {
    title: "No Safety Gear, Just Luck: Life as a Sanitation Worker",
    content: `I clean the city’s underground sewer lines. You read that right — by hand. I go down without protective suits. No gloves. No oxygen supply. Just a rope and someone standing above.

This is supposed to be illegal. But contractors still hire us for a few hundred rupees a day. They mark our payments as “manual sweeping” to avoid scrutiny. Last year, I saw my co-worker pass out inside a chamber. We dragged him out. He never regained full memory after that.

I asked why we aren’t given proper gear. “Too expensive,” they said. One contractor laughed and offered me a surgical mask instead of a gas mask.

I post this here not for pity — but for change. No one should die in shit. That’s the truth.

Attached is a photo I took from inside one of the chambers. My phone almost died from the gas — but I got the shot.`,
    walletAddress: "0x900BcDDdA1123fDc456EAc333444BBccDDD99119",
    timestamp: new Date().toISOString(),
    location: "Lucknow, Uttar Pradesh",
    imgs: ["image_0.jpg"],
    votes: 0,
  },
  {
    title: "The Cost of Silence in Mining Towns",
    content: `I grew up in a mining town in Jharkhand. My father, uncles, and neighbors — all worked in the mines. Most of them now have chronic breathing problems. Some have died. The company gives them 10,000 rupees and a free stretcher ride home. That’s their compensation.

When I started working at the site office, I found internal documents acknowledging dangerous levels of silica in the dust. They knew. They just didn’t care.

When I brought it up in a staff meeting, I was told to “not create noise.” So I started collecting those documents — scans, emails, lab tests. This isn’t just about negligence — it’s about choosing profit over people’s lungs.

I’m no longer working there. But I still live here. And every cough I hear reminds me why I need to speak up.

I’m uploading everything I have — because the truth can’t stay buried underground forever.`,
    walletAddress: "0xCDee9933AAccBB11887766FeEE002299BbAa3322",
    timestamp: new Date().toISOString(),
    location: "Dhanbad, Jharkhand",
    imgs: ["image_0.jpg", "image_1.jpg", "image_2.jpg"],
    votes: 0,
  },
  {
    title: "This Highway Killed 12 People Last Month",
    content: `I drive an ambulance. I’ve seen blood. I’ve seen death. But this highway — the NH-27 stretch near Bahraich — it’s cursed. There are no working street lights for 9 km. The lane dividers are broken. There’s no signage for villages, and pedestrians just try their luck crossing.

Last month alone, we counted 12 accidents. Six were fatal. A truck overturned. A bike hit an old woman. A school van crashed into a ditch. And every time, we rushed there with no support. No police. No medical post. Just darkness.

I wrote to the district office. No reply. I shared photos with a local journalist. He said it’s “too sensitive” to cover. I don’t have power. But I have truth. And wheels. And eyes.

Attached are photos of the accident sites. If you’re reading this and someone you know travels that stretch — warn them. Until someone in power decides to care, it’s up to us.`,
    walletAddress: "0xEaBb99112233CC44ddEEaa3344556677AbCdEf12",
    timestamp: new Date().toISOString(),
    location: "Bahraich, Uttar Pradesh",
    imgs: ["image_0.jpg", "image_1.jpg"],
    votes: 0,
  },
]
